#대출 상환금 계산 서비스
#작성자 : 문용호
#변수 : p,y,r
#p : 원금 - 백만이상 정수만 허용
#y : 상환기간 - 1이상정수만 허용
#r : 연이자율 - 0.0에서 100.00사이의 부동소수점수만 허용.
#################################################################
print("대출 상환금 계산 서비스에 오심을 환영합니다.")

#################################################################
p = input("대출원금이 얼마인가요?(백만이상)")
while not (p.isdigit() or int(p) >= 1000000) :
    print("다시 입력해주세요.")
    p = input("대출원금이 얼마인가요?(백만이상)")
p = int(p)
#################################################################
y = input("상환기간은 몇년인가요?(1년이상 연단위)")
while not (y.isdigit() or int(y)>=1):
    print("다시 입력해주세요.")
    y = input("상환기간은 몇년인가요?(1년이상 연단위)")
y = int(y)
#################################################################
r = input("이자율은 몇%인가요?(0~100)")
t = r.partition(".")
while not ((t[0].isdigit() and t[2].isdigit or t[0].isdigit and t[2]=="" or t[0]=="" and t[2].isdigit()) and 0<=float(r)<=100) :
    print("다시 입력해주세요.")
    r = input("이자율은 몇%인가요?(0~100)")
    t = r.partition(".")
r = float(r)/100
#################################################################

d = (1 + r)**y*p*r/((1 + r)**y-1)
m = d/12                       #월 상환
x = y*d                        #총 상환금액
print("대출상환금 내역을 알려드리겠습니다.")
print("대출원금 : " + str(p))
print("연이자율 " + str(r) + "%로 " + str(y) + "년동안 상환")
print("1년에 한번씩 상환하시면 매년" + str(d) + "원씩 지불하셔야 합니다.")
print("1달에 한번씩 상환하시면 매월" + str(m) + "원씩 지불하셔야 합니다.")
print("상환 완료시까지 총 상환금액은" + str(x) + "원 입니다.")
print("\n저희 서비스를 이용해주셔서 감사합니다.")
print("또 들려주세요.")
